public class Main {
    public static void main(String[] args) {

        System.out.println("Задача об автобусе.");
        System.out.println();
/*
        1) Создать класс Bus с атрибутами: номер маршрута, водитель, вместимость 36 мест, скорость на маршруте
        (не может быть больше 60 км/ч), стоимость проезда 2 евро.
        2) В классе Bus создайте метод setDriver, который принимает имя драйвера и назначает его водителем автобуса.
        3) Сформируйте информцию об автобусе в следующем виде:
        Информация об автобусе:
        Номер маршрута : __
        Вместимость: ___ кресел
        Водитель: _____
        Скорость на маршруте: _____
        4) Создать класс Driver с атрибутами: имя водителя, возраст водителя
        (должен быть старшше 21 года и не старше 65 лет).
        5) Создать класс Passenger с атрибутами: имя, возраст (должен быть старше 10 лет).
        6) Среднестатистическая заполняемость автобуса составляет 60% от его вместимости.
        7) Автобус за день совершает 5 рейсов по маршруту. Рассчитайте объем дневной выручки от работы
        автобуса.*/

        Bus bus = new Bus(23, "Рейсов", 36, 60,2);

        System.out.println(bus);
        System.out.println();

        Driver name = new Driver("Маршрутов", 51);

        System.out.println(name);
        System.out.println();

        Passenger passenger = new Passenger("Вмтя",9);

        System.out.println(passenger);
        System.out.println();

        int revenue = (((36 * 60)/100) * 5) * 2;
        System.out.println("Дневная выручка от работы автобуса: " + revenue);



    }
}